import React from 'react';
import Header from '../components/Home/Banner/Header';
import Footer from '../components/Home/Footer/Footer';

const RefundPolicy = () => {
  return (
    <>
      <Header />
      <div className="supported-browsers-container container">
        <h1 className="heading">রিফান্ড পলিসি</h1>
        <p className="ps-5">
          1.1 কোর্স এনরোলমেন্ট চলাকালীন এবং এনরোল করার সর্বোচ্চ 15 দিনের মধ্যে
          রিফান্ড রিকুয়েস্ট করা যাবে। যদি আপনি এনরোলমেন্ট ডেডলাইন শেষ হবার আগে
          এবং এনরোল করার 15 দিনের মধ্যে রিফান্ড রিকুয়েস্ট করেন, তাহলে
          নিঃশর্তভাবে আপনার পুরো কোর্স ফি রিফান্ড করে দেয়া হবে। কোর্স এনরোলমেন্ট
          ডেডলাইন শেষ হয়ে যাবার পর আপনি কোর্স ফি রিফান্ড রিকুয়েস্ট করতে পারবেন
          না।
        </p>
        <p className="ps-5">
          1.2 রিফান্ড এর টাকা কোনভাবেই সরাসরি ক্যাশ ট্রানজেকশন করা হবে না। আপনি
          আমাদের প্লাটফর্ম থেকে আপনার পছন্দের পেমেন্ট চ্যানেলে পেমেন্ট করতে
          পারবেন এবং রিফান্ড দেয়ার সময় আপনি যে মাধ্যমে পেমেন্ট করেছিলেন, সেই
          মাধ্যমেই রিফান্ড করার চেষ্টা করা হবে। রিফান্ড করতে গিয়ে সংশ্লিষ্ট
          মাধ্যমে কোন সার্ভিস চার্জ প্রযোজ্য হলে সেই চার্জ কাস্টোমারকে বহন করতে
          হবে।
        </p>
        <p className="ps-5">
          1.4 আপনার কোর্স রিফান্ড রিকুয়েস্টটি সফল হবার পর আপনি কোর্সের সমস্ত
          এক্সেস হারাবেন এবং আমাদের প্লাটফর্মে আর লগইন করতে পারবেন না।
        </p>
        <p className="ps-5">
          1.5 কোর্সে এনরোল করার পূর্বে কোর্স কারিকুলাম দেখে নিবেন, অন্যথায়
          পরবর্তীতে এনরোলমেন্ট ডেডলাইন শেষে কোর্স কারিকুলাম বিষয়ে কোন অভিযোগের
          কারণে রিফান্ড রিকুয়েস্ট গ্রহন করা হবে না। "আমি ওয়েবসাইটের এই জায়গাটা
          দেখিনি, ভাল করে পড়ে দেখিনি, সময় পাইনি, আমার চোখ এড়িয়ে গেছে" - এধরণের
          কোন অনুরোধ আমাদের কাছে গ্রহণযোগ্য হবেনা।
        </p>
      </div>

      <Footer />
    </>
  );
};

export default RefundPolicy;
