import React from 'react';
import { VscPassFilled } from 'react-icons/vsc';
import Header from '../components/Home/Banner/Header';
import Footer from '../components/Home/Footer/Footer';

const SupportedBrowsers = () => {
  return (
    <>
      <Header />
      <div className="supported-browsers-container container">
        <h1 className="heading">
          আমাদের ভিডিওগুলো আপনার ডিভাইসে না চললে যেভাবে সমাধান করবেন
        </h1>
        <p>
          ভিডিও পাইরেসি এবং আন-অথোরাইজড ভিডিও ডাউনলোড আটকানোর জন্য টেকএনালাইজেন
          প্লাটফর্ম মডার্ন টেকনোলজির সর্বোচ্চ ব্যবহার করে সিকিউর ভিডিও সার্ভিসের
          মাধ্যমে কোর্সের ভিডিওগুলো ডিস্ট্রিবিউট করে থাকে। এই সিক্যুরিটি ফিচার
          গুলো আমাদের জন্য অত্যন্ত গুরুত্বপূর্ণ এবং ইউজারকে বেশ কিছু শর্ত মেনে
          ভিডিওগুলো দেখতে হবে। এরকম রেস্ট্রিকটেড ভিডিও ডেলিভারি কন্টেন্ট পাইরেসি
          আটকানোর জন্য আমাদের কে করতে হচ্ছে। যেদিন বাংলাদেশে আর কোন কন্টেন্ট
          পাইরেসি থাকবেনা এবং সঠিক কপিরাইট আইন প্রণীত হবে, সেদিন আশা করি
          আমাদেরকেও প্রচুর টাকা খরচ করে এই কন্টেন্ট রেস্ট্রিকশন গুলো বসাতে
          হবেনা। আপনার ডিভাইসে ভিডিওগুলো যদি না চলে, সেক্ষেত্রে নিচের
          ট্রাবলশুটিং স্টেপ গুলো ফলো করলে সমাধান হয়ে যাবে:
        </p>

        <div className="sub-heading">
          <span className="icon">
            <VscPassFilled />
          </span>
          <span>ডেস্কটপ/ল্যাপটপ (উইন্ডোজ, ম্যাক, লিনাক্স)</span>
        </div>
        <p>
          1. ডেস্কটপে ক্রোম এবং ফায়ারফক্স এর লেটেস্ট আপডেটেড ভার্সন আমরা
          রেকোমেন্ড করছি। এছাড়াও আপনার অপারেটিং সিস্টেমকে সর্বোত্তম সংস্করণে
          আপডেট করা উচিত। যদি আমাদের ভিডিও প্লেয়ারে ব্রাউজার/OS আপগ্রেড করার
          জন্য একটি বার্তা দেখায়, অনুগ্রহ করে প্রথমে Chrome/Firefox আপডেট করুন।
        </p>
        <p>
          2. Windows 10-এ সর্বশেষ আপডেট করা এজ ব্রাউজার, Windows 8 এও আমাদের
          ওয়েবসাইট দেখতে পারবেন ভালভাবে। তবে ব্যবহারকারীদের অবশ্যই তাদের এজ
          ব্রাউজার (83 এবং উচ্চতর) আপডেট করতে হবে। পুরানো সংস্করণ সমর্থিত নয়।
        </p>
        <div className="sub-heading">
          <span className="icon">
            <VscPassFilled />
          </span>
          <span>এন্ড্রয়েড (ফোন/ট্যাবলেট)</span>
        </div>
        <p>
          1. সর্বশেষ আপডেট করা ক্রোম ব্রাউজার (শুধুমাত্র Android OS &gt; 5 এর
          জন্য সমর্থিত) আমরা রেকোমেন্ড করছি। যদি আমাদের ভিডিওগুলো ক্রোমে না চলে
          তাহলে অনুগ্রহ করে লেটেস্ট কোন জনপ্রিয় ব্রাউজারে দেখার চেষ্টা করুন যা
          অ্যান্ড্রয়েডে Widevine HTML প্লেব্যাক সমর্থন করতে পারে।
        </p>
        <p>
          2. সর্বশেষ আপডেট হওয়া 'Firefox' বা আপডেট করা 'Edge' ব্রাউজার এও চলতে
          পারে। এক কথায় বললে, ক্রোম অ্যান্ড্রয়েডে ডিফল্ট সবচেয়ে রেকোমেণ্ডেড
          ব্রাউজার, তবে অ্যান্ড্রয়েড ক্রোমের ক্ষেত্রে 1% ইউজার সমস্যা ফেস করতে
          পারেন। এই ধরনের ব্যবহারকারীদের অ্যান্ড্রয়েডে সর্বশেষ আপডেট হওয়া
          'ফায়ারফক্স' বা আপডেট করা 'এজ' ব্রাউজারে চেষ্টা করা উচিত।
        </p>
        <div className="sub-heading">
          <span className="icon">
            <VscPassFilled />
          </span>
          <span>iOS (Phone/Ipad)</span>
        </div>
        <p>
          1. আমরা আপডেট করা Safari সবচেয়ে বেশি রেকোমেন্ড করছি। অনেক ডিভাইসের
          ক্ষেত্রে ক্রোম ব্রাউজারও ভিডিও চালাতে সক্ষম হতে পারে (বিশেষ করে আইওএস
          14 ব্যবহারকারী), কিন্তু কিছু পুরানো আইওএস ক্রোম ব্যবহারকারীরা ভিডিও
          দেখতে পাবেন না। তাই আপডেট করা সাফারি সবচেয়ে রেকোমেন্ডেড।
        </p>
        <p>
          2. ভিডিও প্লেব্যাকের জন্য iOS &gt; 11.2 প্রয়োজন৷ iOS &lt; 11.2
          ডিভাইসগুলি সমস্যার সম্মুখীন হতে পারে।
        </p>

        <h2 className="heading mt-5 pt-5">সাধারণ কিছু নির্দেশনা</h2>
        <p>
          1. একসাথে অনেক গুলো ব্রাউজার ট্যাব ওপেন থাকলে সেগুলো বন্ধ করুন।
          সর্বোচ্চ তিনটির বেশি ট্যাব ওপেন রাখবেন না।
        </p>
        <p>
          2. আপনার পিসি বা মোবাইল ব্রাউজারে কোন adblocker/vpn/proxy/download
          grabber টাইপ extension থাকলে সেগুলো uninstall করুন। এক্ষেত্রে আপনার
          লেটেস্ট ক্রোম বা ফায়ারফক্স ব্রাউজারের incognito mode/private mode এ
          একবার ব্রাউজিং করে দেখতে পারেন। যদি কাজ করে তার মানে আপনার ব্রাউজারের
          কোন এক্সটেনশন সমস্যা করছে।
        </p>
        <p>
          3. যদি আপনি গুগল মিট, জুম, টিমভিউয়ার, OBS Studio বা এধরণের কোন
          সফটওয়্যার ব্যবহার করে থাকেন, সেগুলো বন্ধ করে চেষ্টা করুন।
        </p>
        <p>
          4. আপনার পিসি বা মোবাইলের স্ক্রিন রেকোর্ড করছে, এরকম কোন সফটওয়্যার বা
          এক্সটেনশন থাকলে সেগুলো ক্লোজ করুন।
        </p>
        <p>
          5. যদি আপনি ডেস্কটপ এ ব্রডব্যান্ড ইন্টারনেট কানেকশনে দেখতে না পান,
          কিন্তু মোবাইল হটস্পট এ দেখতে পান, তাহলে এটা নিশ্চিত হয়ে নিন যে আপনার
          ব্রডব্যান্ড ইন্টারনেট আপনাকে কোন proxy, firewall বা vpn দিয়ে ব্রাউজ
          করাচ্ছে কিনা। করলে সেটি বন্ধ করুন।
        </p>
        <p>
          6. যদি আপনি এক্সটার্নাল ডিভাইস কানেক্ট করলে ভিডিও না চলে, তাহলে
          এক্সটার্নাল ডিভাইস ডিস্কানেক্ট করুন যেমন ডক স্টেশন।
        </p>
        <p>
          7. মোবাইলে আমাদের ওয়েবসাইট দেখা বা শেখা আমরা নিরুৎসাহিত করছি। তারপর ও
          যদি আপনি দেখতে চান, সেক্ষেত্রে উপরের "android" / "iOS" ডিভাইসের
          instruction টি ফলো করুন।
        </p>
        <hr />

        <p>
          এরপরেও যদি আপনার ভিডিও না চলে, তাহলে আপনার ভিডিও প্লেয়ার এর এরর
          মেসেজের একটি ছবি, এবং ব্রাউজারের console এর এরর গুলোর একটি ছবি নিয়ে
          আমাদের সাপোর্ট চ্যানেলে জানান অথবা ইমেইল করুন।
        </p>
        <hr className="mb-5" />
      </div>

      <Footer />
    </>
  );
};

export default SupportedBrowsers;
