import React from 'react';
import Header from '../components/Home/Banner/Header';
import Footer from '../components/Home/Footer/Footer';

const TermsAndConditions = () => {
  return (
    <>
      <Header />
      <div className="supported-browsers-container container">
        <h1 className="heading">প্লাটফর্ম ব্যবহারের শর্তাবলি</h1>
        <div className="sub-heading">
          <span className="icon">1.</span>
          <span>একাউন্ট/প্রোফাইল ক্রিডেনশিয়ালস:</span>
        </div>
        <p className="ps-5">
          1.1 আপনার অ্যাকাউন্ট ক্রিডেনশিয়ালস (ইউজারনেম এবং পাসওয়ার্ড) একান্তই
          আপনার ব্যক্তিগত। এগুলো অন্য কোনো ব্যাক্তি/মাধ্যমের সাথে শেয়ার করা
          কোনভাবেই কাম্য নয়। অ্যাকাউন্ট ক্রিডেনশিয়ালস অন্য কোনো
          ব্যাক্তি/মাধ্যমের সাথে শেয়ার করা হলে আপনার অ্যাকাউন্ট যেকোনো সময় বিনা
          নোটিশে টার্মিনেট করা হতে পারে এবং সেক্ষেত্রে আপনি আর সেই অ্যাকাউন্টটি
          ব্যবহার করতে পারবেন না।
        </p>
        <p className="ps-5">
          1.2 এই কোর্সগুলো সিংগেল ইউজার একাউন্টের জন্য, অর্থাৎ যিনি কিনেছেন
          শুধুমাত্র তার ব্যবহারের জন্য। একই বাসায়/এলাকায় অবস্থানরত
          "ভাই/বোন/আত্মীয়স্বজন কেন ব্যবহার করতে পারবে না" এধরণের প্রশ্ন করা
          থেকে অনুগ্রহ করে বিরত থাকবেন।
        </p>
        <p className="ps-5">
          1.3 আপনি এই কোর্সগুলো একটি মাত্র ডিভাইস থেকে একসেস করতে পারবেন। আপনি
          আরেকটি ডিভাইসে লগইন করলে পুর্বের ডিভাইস থেকে লগ আউট হয়ে যাবেন।
        </p>
        <p className="ps-5">
          1.4 কোর্সে এনরোলমেন্ট এর সময় অথবা ওয়েবসাইটে রেজিস্ট্রেশনের সময় আপনার
          দেয়া সঠিক তথ্য অত্যন্ত গুরুত্বপূর্ণ। কোন কারণে আপনি যদি সঠিক তথ্য
          প্রদান না করেন এবং আমরা সেটি বুঝতে পারি, তাহলে আপনার একাউন্টে যেকোন
          ধরণের সীমাবদ্ধতা দেবার অধিকার টেকএনালাইজেন এর থাকবে। মনে রাখবেন আপনার
          গুরুত্বপূর্ণ ডকুমেন্ট যেমন - কোর্স সার্টিফিকেট, জব রেকোমেন্ডেশন লেটার,
          যেকোন ধরণের কমিউনিকেশনে আপনার দেয়া তথ্য ব্যবহৃত হবে। কোনভাবেই এখানে
          কোন ধরণের কাস্টমাইজেশন বা পরিবর্তন গ্রহণযোগ্য নয়। যেমন উদাহরণস্বরূপ -
          আপনি এনরোলমেন্ট এর সময় যে নাম ব্যবহার করবেন সেই নামেই আপনার
          সার্টিফিকেট তৈরি হবে।
        </p>
        <p className="ps-5">
          1.5 আমরা আপনাকে যে কোন ধরনের ফেক তথ্য যেমন ছদ্মনাম, ফেক ইমেইল এড্রেস,
          ফেক মোবাইল নাম্বার ইত্যাদি প্রদান থেকে বিরত থাকার আহবান জানাচ্ছি। এরকম
          কিছু করা হলে কোর্স এনরোলমেন্ট রিকুয়েস্ট গ্রহণ না করা অথবা রিজেক্ট করার
          অধিকার টেকএনালাইজেন এর থাকবে।
        </p>
        <div className="sub-heading">
          <span className="icon">2. </span>
          <span>কপিরাইট এবং কন্টেন্ট ডিস্ট্রিবিউশন:</span>
        </div>
        <p className="ps-5">
          2.1 টেকএনালাইজেন কর্তৃপক্ষের অনুমতি ব্যতীত যে কোনো কোর্স ম্যাটেরিয়াল
          (ভিডিও, অডিও, ছবি অথবা যেকোন ডকুমেন্ট) ফ্রি অথবা পেইড ডিস্ট্রিবিউশন
          করা সম্পূর্ণরূপে নিষিদ্ধ এবং আইনত দন্ডনীয় অপরাধ। এরকম কিছু করা হলে এবং
          আমরা সেটি বুঝতে পারলে, বাংলাদেশের আইন অনুযায়ী ব্যবস্থা গ্রহণ করার
          অধিকার আমরা রাখি। আমরা আশা করি, এ ব্যাপারে আপনি সতর্ক থাকবেন।
        </p>
        <p className="ps-5">
          2.2 টেকএনালাইজেন প্লাটফর্মের প্রতিটি পেইড ভিডিও কন্টেন্ট এ
          টেকএনালাইজেন - এর রেজিস্টার্ড লোগো ওয়াটারমার্ক হিসেবে দেয়া থাকে। এছাড়া
          প্রতিটি ভিডিওতে ইউজার এর ইমেইল আইডি ডায়নামিকভাবে প্রদর্শন করার অধিকার
          টেকএনালাইজেন এর থাকবে। উক্ত ভিডিওটির মেধাস্বত্ত অধিকার (ইন্টেলেকচুয়াল
          প্রোপার্টি রাইট) সম্পূর্ণরূপে টেকএনালাইজেন এর। যিনি কোর্স বা ভিডিও
          কিনছেন, তিনি শুধু ভিডিওটি দেখার অনুমতি পাবেন। কিন্তু সেটিতে কোনভাবেই
          তার ব্যক্তিগত মেধাস্বত্ব অধিকার থাকবেনা। তাই সেই কন্টেন্টটি কোনভাবেই
          ফ্রি অথবা পেইড ডিস্ট্রিবিউশন করার অধিকার ইউজার এর থাকবেনা। এরকম কিছু
          করা হলে, উক্ত ইউজার এর বিরুদ্ধে গণপ্রজাতন্ত্রী বাংলাদেশ এর আইন অনুযায়ী
          ব্যবস্থা গ্রহণ করার অধিকার টেকএনালাইজেন এর থাকবে। তাই একজন দায়িত্বশীল
          নাগরিক হিসেবে এই বিষয়ে সতর্ক থাকার আহবান জানাচ্ছি। আমরা কোনভাবেই
          চাইনা, এই ভুলের জন্য একজন লার্নার এর ক্যারিয়ার ক্ষতিগ্রস্থ হোক। তাই
          নিজের ক্যারিয়ারের কথা চিন্তা করে এবং সামগ্রিকভাবে কমিউনিটির পরিবেশ
          রক্ষার্থে আপনার সহযোগিতা আমাদের একান্ত কাম্য।
        </p>
        <p className="ps-5">
          2.3 টেকএনালাইজেন - এর কোর্স সম্পর্কিত যেকোনো ভিডিও, টেক্সট বা কনটেন্ট
          টেকএনালাইজেন কর্তৃপক্ষের থেকে লিখিত অনুমতি ছাড়া অন্য কারও সাথে অর্থের
          বিনিময়ে বা বিনামূল্যে আদান-প্রদান বা শেয়ার করা আইনত দন্ডনীয় অপরাধ।
          গুগল ড্রাইভ, ফেইসবুক, ইউটিউব, কিংবা কোনো পেনড্রাইভ, সিডি, ডিভিডি বা
          অন্য কোন মাধ্যমে শেয়ার করলে "টেকএনালাইজেন" কর্তৃপক্ষ বা আইনানুগ
          প্রতিনিধি গণপ্রজাতন্ত্রী বাংলাদেশ সরকার এর কপিরাইট আইন, কপিরাইট এক্ট
          ২০০০, কপিরাইট এক্ট ২০০৫ সংশোধন: সেকশন ৮৪, ডিজিটাল কপিরাইট আইন, Digital
          Security Act, 2018, Digital Security Act, 2018 (সেকশন ১৯) এবং সাইবার
          সিকিউরিটি বা উপযুক্ত আইন অনুসারে প্রয়োজনীয় পদক্ষেপ নিতে পারবে।
        </p>
        <div className="sub-heading">
          <span className="icon">3.</span>
          <span>পেমেন্ট:</span>
        </div>
        <p className="ps-5">
          3.1 আপনি আমাদের ওয়েবসাইট থেকে অনলাইন পেমেন্ট গেটওয়ের মাধ্যমে আপনার
          পছন্দের পেমেন্ট চ্যানেল ব্যবহার করে পেমেন্ট করতে পারবেন। এছাড়া আপনি
          টেকএনালাইজেন - এর বিকাশ মার্চেন্ট নাম্বারে (
          <span className="text-danger">+8801979985368</span>) সরাসরি পেমেন্ট
          করতে পারবেন অথবা টেকএনালাইজেন - এর ব্যাংক একাউন্টে পেমেন্ট করতে পারেন।
          আপনি ব্যাংক একাউন্টে পেমেন্ট করতে চাইলে আমাদের সাপোর্টে থাকা এই
          নাম্বারে - <span className="text-danger">+8801979985368</span> কল করে
          ব্যাংকিং সম্পর্কিত তথ্য জেনে নিয়ে তারপর পেমেন্ট করবেন। পেমেন্ট করে
          আমাদের কে জানালে আমরা চেক করে দেখবো আমাদের ব্যাংক একাউন্টে আপনার
          পেমেন্টটি এসেছে কিনা। এর বাইরে অন্য কোন মানুষের কোথায় ভিন্ন চ্যানেলে
          পেমেন্ট করে প্রতারিত হলে তার দায়ভার টেকএনালাইজেন নিবে না।
        </p>
        <p className="ps-5">
          3.2 সকল প্রকারের পেমেন্ট সক্রান্ত বিষয়ের জন্য টেকএনালাইজেন - এর
          সিদ্ধান্ত চূড়ান্ত। পেমেন্ট করার পূর্বে অবশ্যই কোর্সের মূল্য এবং মাধ্যম
          ভালো ভাবে দেখে নেবেন।
        </p>
        <p className="ps-5">
          3.3 যদি আপনি বাংলাদেশের বাইরে থেকে আমাদের কোন কোর্স কিনতে চান
          সেক্ষেত্রে আপনি আমাদের অনলাইন পেমেন্ট গেটওয়ের মাধ্যমে VISA/Master/AMEX
          ক্রেডিট বা ডেবিট কার্ডের মাধ্যমে পেমেন্ট করতে পারবেন। কিন্তু
          সেক্ষেত্রে অবশ্যই আপনার লোকাল ব্যাংক কর্তৃপক্ষের সাথে কথা বলে ভেরিফাই
          করে নিবেন যে আপনার কার্ডে Foreign E-commerce Purchase ওপেন করা আছে
          কিনা এবং আপনার কার্ড-এ 3D Secure অপশন এনাবল করা আছে কিনা। আর আপনি যদি
          আমাদের ব্যাংক একাউন্টের মাধ্যমে সরাসরি পেমেন্ট করতে চান, তাহলে আমাদের
          সাপোর্ট সেন্টারের নাম্বারে (
          <span className="text-danger">+8801979985368</span>) WhatsApp এ কল করে
          বিস্তারিত জেনে নিন। মনে রাখবেন সেক্ষত্রে সার্ভিস ডেলিভারি তাৎক্ষণিক
          সম্ভব নয় কারণ আমাদের কে ম্যানুয়ালি ব্যাংক কর্তৃপক্ষের সাথে যোগাযোগ করে
          ভেরিফাই করতে হয়। সেক্ষেত্রে ৩-৪ দিন বা কোন কোন ক্ষেত্রে আর বেশি সময়
          লেগে যেতে পারে সার্ভিস ডেলিভারি পেতে।
        </p>
        <div className="sub-heading">
          <span className="icon">4.</span>
          <span>সার্ভিস ডেলিভারি:</span>
        </div>
        <p className="ps-5">
          4.1 টেকএনালাইজেন প্লাটফর্মের সকল কোর্স ক্রয়ের সাথে সাথেই ইউজার এক্সেস
          করতে পারবেন। এক্ষেত্রে সার্ভিস ডেলিভারি টাইমলাইন একেবারে তাৎক্ষণিক।
          আপনি সাথে সাথেই লগইন করে আমাদের সার্ভিস পেতে পারবেন।
        </p>
        <p className="ps-5">
          4.2 যদি আপনি আমাদের ব্যাংক একাউন্টের মাধ্যমে সরাসরি পেমেন্ট করেন,
          সেক্ষত্রে সার্ভিস ডেলিভারি তাৎক্ষণিক সম্ভব নয় কারণ আমাদের কে
          ম্যানুয়ালি ব্যাংক কর্তৃপক্ষের সাথে যোগাযোগ করে ভেরিফাই করতে হয়।
          সেক্ষেত্রে ৩-৪ দিন বা কোন কোন ক্ষেত্রে আর বেশি সময় লেগে যেতে পারে
          সার্ভিস ডেলিভারি পেতে।
        </p>
        <div className="sub-heading">
          <span className="icon">5.</span>
          <span>সাপোর্ট:</span>
        </div>
        <p className="ps-5">
          5.1 কোর্স চলাকালীন সময় কোর্স রিলেটেড সমস্যার সমাধান সর্বোচ্চ 24 ঘন্টার
          মধ্যে প্রদান করার অঙ্গীকার থাকছে। ডিভাইস সংক্রান্ত সমস্যার সমাধান আমরা
          প্রদান করতে বাধ্য থাকবোনা।
        </p>
        <p className="ps-5">
          5.2 আমাদের সকল সাপোর্ট সকাল 10 থেকে রাত 10 টা অবধি সচল থাকবে।
        </p>
        <p className="ps-5">
          5.3 সকল সাপোর্ট প্রাইভেট ডিসকোর্ড চ্যানেলের মাধ্যমে প্রদান করা হবে।
          যদি একান্তই কিছু বিশেষ ক্ষেত্রে শুধু লিখিতভাবে সমাধান না দেয়া সম্ভব
          হয়, তাহলে কল করে, ডিসকোর্ড অডিও চ্যানেলের মাধ্যমে অথবা গুগল মিট কিংবা
          অন্য কোন লাইভ মিটিং প্লাটফর্মের মাধ্যমে সমাধান দেয়া হতে পারে।
        </p>
        <div className="sub-heading">
          <span className="icon">6.</span>
          <span>আচরণ বিধি:</span>
        </div>
        <p className="ps-5">
          6.1 কোর্সে একজন বিগিনার থেকে এক্সপার্ট পর্যন্ত সবাই কে একই ভাবে
          মূল্যায়ন করা হবে । তাই একে অন্যকে অবশ্যই সম্মানের জায়গা নিশ্চিত করে
          মন্তব্য করতে হবে । কোনো ভাবেই কারো কোনো এক্টিভিটি তে যদি মনে হয় যে
          তিনি একজন গ্রুপ মেম্বার/এডমিনকে অসম্মান বা ছোট করছেন, টেকএনালাইজেন টিম
          তার বিরুদ্ধে ব্যবস্থা নিতে পারবেন এবং এক্ষেত্রে টেকএনালাইজেন টিমের
          সিদ্ধান্তই চূড়ান্ত বলে গণ্য হবে।
        </p>
        <p className="ps-5">
          6.2 অনুগ্রহ করে টেকএনালাইজেন - এর সাপোর্ট চ্যাট, গ্রুপ চ্যাট, ফেইসবুক
          গ্রুপ পোস্ট, কমেন্ট, ফেসবুক পেজ অথবা টেকএনালাইজেন সম্পর্কিত যেকোনো
          যোগাযোগ/সামাজিক মাধ্যমে সব ধরণের ব্যাক্তিগত আক্রমন, রাজনৈতিক আলাপ এবং
          হিংসাত্মক কথাবার্তা থেকে বিরত থাকবেন। এরকম যেকোনো কাজের জন্য আপনাকে
          গ্রুপ চ্যাট এবং গ্রুপ মেম্বারশিপ থেকে মিউট/বাতিল করে দেয়া হতে পারে এবং
          পুনরাবৃত্তির ক্ষেত্রে আপনার অ্যাকাউন্ট যেকোনো সময় টার্মিনেট করা হতে
          পারে।
        </p>
        <p className="ps-5">
          6.3 গ্রুপ চ্যাট, ফেইসবুক গ্রুপ পোস্ট, কমেন্ট, ফোরাম অথবা ফেসবুক পেজে
          সকল প্রকার প্রমোশনাল পোস্ট, স্প্যামিং থেকে বিরত থাকুন। এরকম যেকোনো
          কাজের জন্য আপনাকে গ্রুপ চ্যাট এবং গ্রুপ মেম্বাররশিপ থেকে মিউট/বাতিল
          করে দেয়া হবে এবং পুনরাবৃত্তির ক্ষেত্রে আপনার অ্যাকাউন্ট যেকোনো সময়
          টার্মিনেট করা হতে পারে।
        </p>
        <div className="sub-heading">
          <span className="icon">7.</span>
          <span>জব প্লেসমেন্ট:</span>
        </div>
        <p className="ps-5">
          7.1 এই পৃথিবীতে কোন কিছুই নিশ্চিত নয় তাই আমরাও আমাদের কোন কোর্সের
          মাধ্যমে আপনাকে চাকরির নিশ্চয়তা দিতে পারছিনা। আপনি চাকরি পাবেন কিনা
          সেটা নির্ভর করবে আপনার কঠোর পরিশ্রম, অধ্যবসায় এবং স্কিল সেট এর উপরে।
          আমাদের কোর্সগুলো আপনাকে প্রোগ্রামিং-এর জটিল বিষয়গুলোকে সহজ ভাবে বুঝাতে
          সাহায্য করবে, একটি সঠিক গাইডলাইন দিবে এবং সেই সাথে আপনাকে একটি লার্নিং
          প্রসেস এর মধ্যে নিয়ে আসবে। শুধু তাই নয়, আমাদের কোর্সের বিভিন্ন কুইজ,
          এসাইনমেন্ট এবং পরীক্ষা গুলোতে সিরিয়াসভাবে অংশগ্রহণ করলে কোর্স শেষে
          আপনি একটি আত্মবিশ্বাস পাবেন যা আপনাকে চাকরির ইন্টারভিউতে ভাল করতে
          সাহায্য করবে বলে আমাদের বিশ্বাস।
        </p>
        <p className="ps-5">
          7.2 আমাদের কোর্সগুলো থেকে অনেক সময় আমরা ভাল কিছু প্রোগ্রামারকে বাছাই
          করে আমাদের নিজদের কোম্পানি এবং সমমনা ও সহযোগী কোম্পানিগুলোতে
          ইন্টার্নশিপের ব্যবস্থা করতে পারি। কিন্তু সেক্ষেত্রে কোর্সের
          এনরোলমেন্টের আগেই বিস্তারিত শর্ত বলে দেয়া হবে। সব কোর্সেই এই কাজটি
          আমরা করতে পারবো এমন কোন নিশ্চয়তা নেই। যে কোর্স থেকে আমরা ইন্টার্নশিপ
          অফার করবো, সেই কোর্সের আগেই আমরা কোর্সের ডেসক্রিপশনে বিষয়টি জানিয়ে
          দেব।
        </p>
        <p className="ps-5">
          7.3 ইন্টার্নশিপ বা চাকরির ক্ষেত্রে উপযুক্ত ক্যান্ডিডেট আমরা আমাদের
          নিজেদের প্রক্রিয়ায় নির্বাচন করবো। এক্ষেত্রে প্রোগ্রামিং স্কিল এর
          পাশাপাশি আরো অনেক বিষয় আমরা বিবেচনায় রাখবো যেমন - মানুষটি আমাদের সাথে
          কাজ করতে পারবেন কিনা, আমাদের কাজের পরিবেশের সাথে খাপ খাওয়াতে পারবেন
          কিনা, পরিশ্রম করার মানসিকতা আছে কিনা, সফট স্কিল আছে কিনা ইত্যাদি।
          যাদেরকে আমরা আমাদের কাজের জন্য উপযুক্ত বলে মনে করবো, তাদেরকে আমাদের
          বিভিন্ন প্রক্রিয়ায় যাচাই বাছাই করে আমরা ইন্টার্নশিপ অফার করতে পারি।
        </p>
        <p className="ps-5">
          7.4 একজন নির্বাচিত ইন্টার্ন এর সম্মানী/বেতন কত হবে সেটি আগে থেকে
          নির্ধারিত নয়। এটি নির্ভর করবে উপযুক্ত ক্যান্ডিডেটের স্কিলসেট এবং
          আমাদের কাছে গ্রহণযোগ্যতার উপর।
        </p>
        <div className="sub-heading">
          <span className="icon">8.</span>
          <span>শর্তাবলী পরিবর্তন:</span>
        </div>
        <p className="ps-5">
          8.1 টেকএনালাইজেন প্লাটফর্মের যেকোন সেবা যদি আপনি গ্রহণ করেন, কোন কোর্স
          বা কন্টেন্ট ক্রয় করেন, সেই ক্ষেত্রে ধরে নেয়া হবে আপনি উপরের শর্তাবলি
          মেনে নিচ্ছেন। সেই সাথে যে কোনো সময় টেকএনালাইজেন কর্তৃপক্ষ শর্তাবলী
          পরিবর্তন, পরিমার্জন বা সংশোধন করার অধিকার রাখে।
        </p>
        <div className="text-end m-4 py-4 text-secondary update">
          <span>✔️ সর্বশেষ আপডেট - 17 জুলাই 2023 02:30 PM</span>
        </div>
      </div>

      <Footer />
    </>
  );
};

export default TermsAndConditions;
