import React from 'react';

const CourseSystem = () => {
  return (
    <section className="system_section">
      <div className="container">
        <div className="system_icon">
          <img alt="" src="/assets/images/svg/educators-svgrepo-com.svg" />
        </div>

        <div className="system_text">
          <h3>
            যে <span>পদ্ধতি</span> অনুসরণ করা হবে
          </h3>
        </div>

        <div className="system_content">
          <div className="first_type_item">
            <div className="system_image_left py-3">
              <img alt="" src="/assets/images/curriculum/assignment.svg" />
            </div>

            <div className="system_text_right py-3">
              <h2>প্রতি মাইলস্টোন শেষে থাকছে এসাইনমেন্ট</h2>
              <p>
                বস্তুনিষ্ঠ প্রবন্ধে লেখক নিরাসক্তভাবে বিষয়ের উপর কর্তৃত্ব
                স্থাপন করে যুক্তিশৃঙ্খলার মাধ্যমে গভীরভাবে বিষয় বিশেষণ করেন।
                চিন্তাশীল অনুসন্ধানী পাঠক এ জাতীয় প্রবন্ধের অনুরাগী।
                বঙ্কিমন্দ্রের 'বাঙ্গালা ভাষা' বস্তুনিষ্ঠ প্রবন্ধের অন্তর্ভুক্ত।
                এছাড়াও বঙ্কিমচন্দ্রের 'প্রবন্ধপুস্তক', জ্যোতিরিন্দ্র নাথের
                'প্রবন্ধমধুরী', রাজকৃষ্ণ মুখোপাধ্যায়ের 'নানা প্রবন্ধ', কাজী
                মোতাহের হোসেনের 'সংস্কৃতি কথা', এসব প্রবন্ধ তন্ময় বা বস্তুনিষ্ঠ
                প্রবন্ধ। ভাবনিষ্ট বা মন্ময় প্রবন্ধকে ব্যক্তি প্রবন্ধ হিসেবেও
                আখ্যায়িত করা হয়। এ ধরনের প্রবন্ধে বিষয় অপেক্ষা লেখক পাঠককেই
                বেশি গুরুত্ব দেন। নিজের অনুভূতিকে পাঠকের অনুভূতি ও সংবেদনশীলতার
                সঙ্গে সংযুক্ত করতে চান। বলা যায়, এ-জাতীয় প্রবন্ধে লেখকের
                ব্যক্তিসত্তার 'আত্মপ্রকাশ' ঘটে।
              </p>
            </div>
          </div>

          <div className="second_type_item">
            <div className="second_left_text py-3">
              <h2 className="text_heading ">মডিউলভিত্তিক পদ্ধতি</h2>
              <p>
                বস্তুনিষ্ঠ প্রবন্ধে লেখক নিরাসক্তভাবে বিষয়ের উপর কর্তৃত্ব
                স্থাপন করে যুক্তিশৃঙ্খলার মাধ্যমে গভীরভাবে বিষয় বিশেষণ করেন।
                চিন্তাশীল অনুসন্ধানী পাঠক এ জাতীয় প্রবন্ধের অনুরাগী।
                বঙ্কিমন্দ্রের 'বাঙ্গালা ভাষা' বস্তুনিষ্ঠ প্রবন্ধের অন্তর্ভুক্ত।
                এছাড়াও বঙ্কিমচন্দ্রের 'প্রবন্ধপুস্তক', জ্যোতিরিন্দ্র নাথের
                'প্রবন্ধমধুরী', রাজকৃষ্ণ মুখোপাধ্যায়ের 'নানা প্রবন্ধ', কাজী
                মোতাহের হোসেনের 'সংস্কৃতি কথা', এসব প্রবন্ধ তন্ময় বা বস্তুনিষ্ঠ
                প্রবন্ধ। ভাবনিষ্ট বা মন্ময় প্রবন্ধকে ব্যক্তি প্রবন্ধ হিসেবেও
                আখ্যায়িত করা হয়। এ ধরনের প্রবন্ধে বিষয় অপেক্ষা লেখক পাঠককেই
                বেশি গুরুত্ব দেন। নিজের অনুভূতিকে পাঠকের অনুভূতি ও সংবেদনশীলতার
                সঙ্গে সংযুক্ত করতে চান। বলা যায়, এ-জাতীয় প্রবন্ধে লেখকের
                ব্যক্তিসত্তার 'আত্মপ্রকাশ' ঘটে।
              </p>
            </div>

            <div className="system_image_right py-3">
              <img alt="" src="/assets/images/curriculum/module_system.svg" />
            </div>
          </div>

          <div className="first_type_item">
            <div className="system_image_left py-3">
              <img src="/assets/images/curriculum/quiz.svg" alt="" />
            </div>

            <div className="system_text_right py-3">
              <h2>প্রতি মডিউল শেষে কুইজ রয়েছে</h2>
              <p>
                বস্তুনিষ্ঠ প্রবন্ধে লেখক নিরাসক্তভাবে বিষয়ের উপর কর্তৃত্ব
                স্থাপন করে যুক্তিশৃঙ্খলার মাধ্যমে গভীরভাবে বিষয় বিশেষণ করেন।
                চিন্তাশীল অনুসন্ধানী পাঠক এ জাতীয় প্রবন্ধের অনুরাগী।
                বঙ্কিমন্দ্রের 'বাঙ্গালা ভাষা' বস্তুনিষ্ঠ প্রবন্ধের অন্তর্ভুক্ত।
                এছাড়াও বঙ্কিমচন্দ্রের 'প্রবন্ধপুস্তক', জ্যোতিরিন্দ্র নাথের
                'প্রবন্ধমধুরী', রাজকৃষ্ণ মুখোপাধ্যায়ের 'নানা প্রবন্ধ', কাজী
                মোতাহের হোসেনের 'সংস্কৃতি কথা', এসব প্রবন্ধ তন্ময় বা বস্তুনিষ্ঠ
                প্রবন্ধ। ভাবনিষ্ট বা মন্ময় প্রবন্ধকে ব্যক্তি প্রবন্ধ হিসেবেও
                আখ্যায়িত করা হয়। এ ধরনের প্রবন্ধে বিষয় অপেক্ষা লেখক পাঠককেই
                বেশি গুরুত্ব দেন। নিজের অনুভূতিকে পাঠকের অনুভূতি ও সংবেদনশীলতার
                সঙ্গে সংযুক্ত করতে চান। বলা যায়, এ-জাতীয় প্রবন্ধে লেখকের
                ব্যক্তিসত্তার 'আত্মপ্রকাশ' ঘটে।
              </p>
            </div>
          </div>

          <div className="second_type_item">
            <div className="second_left_text py-3">
              <h2 className="text_heading "> টাস্ক থাকবে প্রতি মাইলস্টোনে</h2>
              <p>
                বস্তুনিষ্ঠ প্রবন্ধে লেখক নিরাসক্তভাবে বিষয়ের উপর কর্তৃত্ব
                স্থাপন করে যুক্তিশৃঙ্খলার মাধ্যমে গভীরভাবে বিষয় বিশেষণ করেন।
                চিন্তাশীল অনুসন্ধানী পাঠক এ জাতীয় প্রবন্ধের অনুরাগী।
                বঙ্কিমন্দ্রের 'বাঙ্গালা ভাষা' বস্তুনিষ্ঠ প্রবন্ধের অন্তর্ভুক্ত।
                এছাড়াও বঙ্কিমচন্দ্রের 'প্রবন্ধপুস্তক', জ্যোতিরিন্দ্র নাথের
                'প্রবন্ধমধুরী', রাজকৃষ্ণ মুখোপাধ্যায়ের 'নানা প্রবন্ধ', কাজী
                মোতাহের হোসেনের 'সংস্কৃতি কথা', এসব প্রবন্ধ তন্ময় বা বস্তুনিষ্ঠ
                প্রবন্ধ। ভাবনিষ্ট বা মন্ময় প্রবন্ধকে ব্যক্তি প্রবন্ধ হিসেবেও
                আখ্যায়িত করা হয়। এ ধরনের প্রবন্ধে বিষয় অপেক্ষা লেখক পাঠককেই
                বেশি গুরুত্ব দেন। নিজের অনুভূতিকে পাঠকের অনুভূতি ও সংবেদনশীলতার
                সঙ্গে সংযুক্ত করতে চান। বলা যায়, এ-জাতীয় প্রবন্ধে লেখকের
                ব্যক্তিসত্তার 'আত্মপ্রকাশ' ঘটে।
              </p>
            </div>

            <div className="system_image_right py-3">
              <img src="/assets/images/curriculum/task.svg" alt="" />
            </div>
          </div>

          <div className="first_type_item">
            <div className="system_image_left py-3">
              <img alt="" src="/assets/images/curriculum/online_learning.svg" />
            </div>

            <div className="system_text_right py-3">
              <h2>অনলাইন এবং অফলাইন সুবিধা</h2>
              <p>
                বস্তুনিষ্ঠ প্রবন্ধে লেখক নিরাসক্তভাবে বিষয়ের উপর কর্তৃত্ব
                স্থাপন করে যুক্তিশৃঙ্খলার মাধ্যমে গভীরভাবে বিষয় বিশেষণ করেন।
                চিন্তাশীল অনুসন্ধানী পাঠক এ জাতীয় প্রবন্ধের অনুরাগী।
                বঙ্কিমন্দ্রের 'বাঙ্গালা ভাষা' বস্তুনিষ্ঠ প্রবন্ধের অন্তর্ভুক্ত।
                এছাড়াও বঙ্কিমচন্দ্রের 'প্রবন্ধপুস্তক', জ্যোতিরিন্দ্র নাথের
                'প্রবন্ধমধুরী', রাজকৃষ্ণ মুখোপাধ্যায়ের 'নানা প্রবন্ধ', কাজী
                মোতাহের হোসেনের 'সংস্কৃতি কথা', এসব প্রবন্ধ তন্ময় বা বস্তুনিষ্ঠ
                প্রবন্ধ। ভাবনিষ্ট বা মন্ময় প্রবন্ধকে ব্যক্তি প্রবন্ধ হিসেবেও
                আখ্যায়িত করা হয়। এ ধরনের প্রবন্ধে বিষয় অপেক্ষা লেখক পাঠককেই
                বেশি গুরুত্ব দেন। নিজের অনুভূতিকে পাঠকের অনুভূতি ও সংবেদনশীলতার
                সঙ্গে সংযুক্ত করতে চান। বলা যায়, এ-জাতীয় প্রবন্ধে লেখকের
                ব্যক্তিসত্তার 'আত্মপ্রকাশ' ঘটে।
              </p>
            </div>
          </div>

          <div className="second_type_item">
            <div className="second_left_text py-3">
              <h2 className="text_heading ">সাপোর্ট সিস্টেম</h2>
              <p>
                বস্তুনিষ্ঠ প্রবন্ধে লেখক নিরাসক্তভাবে বিষয়ের উপর কর্তৃত্ব
                স্থাপন করে যুক্তিশৃঙ্খলার মাধ্যমে গভীরভাবে বিষয় বিশেষণ করেন।
                চিন্তাশীল অনুসন্ধানী পাঠক এ জাতীয় প্রবন্ধের অনুরাগী।
                বঙ্কিমন্দ্রের 'বাঙ্গালা ভাষা' বস্তুনিষ্ঠ প্রবন্ধের অন্তর্ভুক্ত।
                এছাড়াও বঙ্কিমচন্দ্রের 'প্রবন্ধপুস্তক', জ্যোতিরিন্দ্র নাথের
                'প্রবন্ধমধুরী', রাজকৃষ্ণ মুখোপাধ্যায়ের 'নানা প্রবন্ধ', কাজী
                মোতাহের হোসেনের 'সংস্কৃতি কথা', এসব প্রবন্ধ তন্ময় বা বস্তুনিষ্ঠ
                প্রবন্ধ। ভাবনিষ্ট বা মন্ময় প্রবন্ধকে ব্যক্তি প্রবন্ধ হিসেবেও
                আখ্যায়িত করা হয়। এ ধরনের প্রবন্ধে বিষয় অপেক্ষা লেখক পাঠককেই
                বেশি গুরুত্ব দেন। নিজের অনুভূতিকে পাঠকের অনুভূতি ও সংবেদনশীলতার
                সঙ্গে সংযুক্ত করতে চান। বলা যায়, এ-জাতীয় প্রবন্ধে লেখকের
                ব্যক্তিসত্তার 'আত্মপ্রকাশ' ঘটে।
              </p>
            </div>

            <div className="system_image_right py-3">
              <img src="/assets/images/curriculum/support.svg" alt="" />
            </div>
          </div>

          <div className="first_type_item">
            <div className="system_image_left py-3">
              <img src="/assets/images/curriculum/solution.svg" alt="" />
            </div>

            <div className="system_text_right py-3">
              <h2>প্রবলেম সলভিং গাইডলাইন</h2>
              <p>
                বস্তুনিষ্ঠ প্রবন্ধে লেখক নিরাসক্তভাবে বিষয়ের উপর কর্তৃত্ব
                স্থাপন করে যুক্তিশৃঙ্খলার মাধ্যমে গভীরভাবে বিষয় বিশেষণ করেন।
                চিন্তাশীল অনুসন্ধানী পাঠক এ জাতীয় প্রবন্ধের অনুরাগী।
                বঙ্কিমন্দ্রের 'বাঙ্গালা ভাষা' বস্তুনিষ্ঠ প্রবন্ধের অন্তর্ভুক্ত।
                এছাড়াও বঙ্কিমচন্দ্রের 'প্রবন্ধপুস্তক', জ্যোতিরিন্দ্র নাথের
                'প্রবন্ধমধুরী', রাজকৃষ্ণ মুখোপাধ্যায়ের 'নানা প্রবন্ধ', কাজী
                মোতাহের হোসেনের 'সংস্কৃতি কথা', এসব প্রবন্ধ তন্ময় বা বস্তুনিষ্ঠ
                প্রবন্ধ। ভাবনিষ্ট বা মন্ময় প্রবন্ধকে ব্যক্তি প্রবন্ধ হিসেবেও
                আখ্যায়িত করা হয়। এ ধরনের প্রবন্ধে বিষয় অপেক্ষা লেখক পাঠককেই
                বেশি গুরুত্ব দেন। নিজের অনুভূতিকে পাঠকের অনুভূতি ও সংবেদনশীলতার
                সঙ্গে সংযুক্ত করতে চান। বলা যায়, এ-জাতীয় প্রবন্ধে লেখকের
                ব্যক্তিসত্তার 'আত্মপ্রকাশ' ঘটে।
              </p>
            </div>
          </div>
        </div>
      </div>
    </section>
  );
};

export default CourseSystem;
